results/node/vercube.txt
Bundle: 570.7 KB
Startup: 65.4 ms
Memory before: 97.8 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    101976.51    7940.11  121750.38
  Latency        4.90ms    12.69ms      1.27s
  HTTP codes:
    1xx - 0, 2xx - 1019955, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    22.85MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     84831.47    9411.04  111636.98
  Latency        5.89ms    14.58ms      1.37s
  HTTP codes:
    1xx - 0, 2xx - 848776, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    20.31MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     81946.30    7485.08   95688.33
  Latency        6.10ms    16.17ms      1.45s
  HTTP codes:
    1xx - 0, 2xx - 819882, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    24.69MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       249.59     188.47     924.07
  Latency       40.19ms     8.16ms   148.70ms
  HTTP codes:
    1xx - 0, 2xx - 2490, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     3.28GB/s

Memory after: 377.3 MB